maxiclass/Esp8266_15.6.2019/Drivers_for_esp8266/Timer.cpp
#include "ESP8266WebServer.h"
#include <cstdint>
#include <stdlib.h>
#include "ShareableResources.h"
#include "Servo.h"                //including the servo library
#include "Motors.h"
#include "Control.h"
#include "MpuControl.h"

 void InitTimer1(void);
 void vDoIsr1Sec(void);
 void ScheduleTime1(void);
// initialize timer1 
void InitTimer1()
{
	noInterrupts();
	timer0_isr_init();
	timer0_attachInterrupt(ScheduleTime1);
	timer0_write(ESP.getCycleCount() + 160000); //160Mhz -> 160*10^6 = 1 second (160000000)
	interrupts();

}

void ScheduleTime1()
{
	// Set-up the next interrupt cycle
	timer0_write(ESP.getCycleCount() + 160000); //160Mhz -> 160*10^6 = 1 second (160000000)

	u32milisecondsCounter++;

	//activate 1 second interruput
	if ((u32milisecondsCounter % 100) == 0)
	{
		//vSystemDroneControl();
		noInterrupts();

			vMadgwickFilterControl();
			vPrintEulerAngles();
			vMainPIDDroneControl(10);
		interrupts();
		//activate 1 second interruput
		if ((u32milisecondsCounter % 10000) == 0)
		{
			//vSystemDroneControl();
			vDoIsr1Sec();
			//vprint_Mpu_data();

		}


	}




}


void vDoIsr1Sec()
{
	u32secondsCounter++;


	if ((u32secondsCounter % 60) == 0)
	{
		u32minutesCounter++; // TODO 1 minute Isr function
	}
}